doc/examples/fluidsimfoam-firefoam/src/fluidsimfoam_firefoam/templates/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    fire_inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }

    door_right
    {
        type            totalPressure;
        p0              uniform 101325;
    }
    door_left
    {
        type            totalPressure;
        p0              uniform 101325;
    }


    main_outlet
    {
        type            totalPressure;
        p0              uniform 101325;
    }


    Door_wood_LEFT_left
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }

    Door_wood_LEFT_right
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }


    Door_wood_MAIN_right
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }

    Door_wood_MAIN_left
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }


    Door_wood_RIGHT_left
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }


    Door_wood_RIGHT_right
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }


    Hearth
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }

    walls
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }

}


// ************************************************************************* //
