doc/examples/fluidsimfoam-firefoam/src/fluidsimfoam_firefoam/templates/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.76699;

boundaryField
{
    fire_inlet
    {
        type            calculated;
        value           uniform 0;
    }

    door_right
    {
        type            inletOutlet;
        inletValue      uniform 0.76699;
        value           uniform 0.76699;
    }

    door_left
    {
        type            inletOutlet;
        inletValue      uniform 0.76699;
        value           uniform 0.76699;
    }


    main_outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.76699;
        value           uniform 0.76699;
    }


    Door_wood_LEFT_left
    {
        type            zeroGradient;
    }

    Door_wood_LEFT_right
    {
        type            zeroGradient;
    }


    Door_wood_MAIN_right
    {
        type            zeroGradient;
    }

    Door_wood_MAIN_left
    {
        type            zeroGradient;
    }


    Door_wood_RIGHT_left
    {
        type            zeroGradient;
    }


    Door_wood_RIGHT_right
    {
        type            zeroGradient;
    }


    Hearth
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
