doc/examples/fluidsimfoam-firefoam/src/fluidsimfoam_firefoam/templates/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: F:\Pooria\Combustion\Simulation\Geometry\for_openfoam\01dec\allparts_surfaces.blend
// Export date: 2025-12-01 16:31:03.041138

numberOfSubdomains 10;

method          scotch;
// method          simple;

simpleCoeffs
{
    n               (1 1 10);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 1 10);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}
